1c-client/src/Catalogs/AIG_Инструменты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>AIG_Инструменты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ДоступныеОбъекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Доступен</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Синоним</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Purpose</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Analytics</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

1c-client/src/CommonModules/AIG_Инструменты/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

Функция ПолучитьИнструменты() Экспорт
	
	ТаблицаИнструментов = ТаблицаИнструментов();
	ЗаполнитьТаблицуИнструментов(ТаблицаИнструментов);
	
	Возврат ТаблицаИнструментов;
	
КонецФункции

Функция ВыполнитьИнструмент(СтрокаТаблицыИнструментов, Параметры) Экспорт
	
	ИмяОбработки 			= СтрокаТаблицыИнструментов.ИмяОбработкиКонтейнера;
	ИмяИнструмента 			= СтрокаТаблицыИнструментов.Имя;
	НастройкаИнструмента 	= СтрокаТаблицыИнструментов.Инструмент;
	
	МенеджерОбработки = Обработки[ИмяОбработки];
	
	Возврат МенеджерОбработки.ВыполнитьИнструмент(ИмяИнструмента, Параметры, НастройкаИнструмента);
	
КонецФункции                 

Процедура ДобавитьИнструмент(ТаблицаИнструментов, Имя, Описание, СхемаПараметров) Экспорт
	
	НоваяСтрока = ТаблицаИнструментов.Добавить();
	НоваяСтрока.Имя = Имя;
	НоваяСтрока.Описание = Описание;
	НоваяСтрока.СхемаПараметров = СхемаПараметров;
	
КонецПроцедуры

Функция ВернутьДоступныеОбъектыИнструмента(ИмяИнструмента) Экспорт
	
	ТаблицаИнструментов = AIG_ИнструментыПовтИсп.Инструменты();
	СтрокаИнструмента = ТаблицаИнструментов.Найти(ИмяИнструмента, "Имя");
	
	Если СтрокаИнструмента = Неопределено Тогда
		ВызватьИсключение СтрШаблон("Инструмент '%1' не найден", ИмяИнструмента);
	КонецЕсли;
	
	ИмяОбработки = СтрокаИнструмента.ИмяОбработкиКонтейнера;
	
	МенеджерОбработки = Обработки[ИмяОбработки];
	
	Возврат МенеджерОбработки.ВернутьДоступныеОбъектыИнструмента(ИмяИнструмента);
	
КонецФункции

Функция ВернутьНастройкиИнструмента(Инструмент) Экспорт
	
	ТаблицаНастроек = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	AIG_ИнструментыДоступныеОбъекты.Имя КАК Имя,
		|	AIG_ИнструментыДоступныеОбъекты.Синоним КАК Синоним,
		|	AIG_ИнструментыДоступныеОбъекты.Доступен КАК Доступен,
		|	AIG_ИнструментыДоступныеОбъекты.Описание КАК Описание,
		|	AIG_ИнструментыДоступныеОбъекты.Purpose КАК Purpose,
		|	AIG_ИнструментыДоступныеОбъекты.Analytics КАК Analytics
		|ИЗ
		|	Справочник.AIG_Инструменты.ДоступныеОбъекты КАК AIG_ИнструментыДоступныеОбъекты
		|ГДЕ
		|	AIG_ИнструментыДоступныеОбъекты.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Инструмент);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		
		ТаблицаНастроек = РезультатЗапроса.Выгрузить();		
	КонецЕсли;

	Возврат ТаблицаНастроек;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТаблицаИнструментов()
	
	ТаблицаИнструментов = Новый ТаблицаЗначений;
	ТаблицаИнструментов.Колонки.Добавить("ИмяОбработкиКонтейнера", 	Новый ОписаниеТипов("Строка"));
	ТаблицаИнструментов.Колонки.Добавить("Имя", 					Новый ОписаниеТипов("Строка"));
	ТаблицаИнструментов.Колонки.Добавить("Описание", 				Новый ОписаниеТипов("Строка"));
	ТаблицаИнструментов.Колонки.Добавить("СхемаПараметров", 		Новый ОписаниеТипов("Строка"));
	ТаблицаИнструментов.Колонки.Добавить("required", 				Новый ОписаниеТипов("Строка"));
	ТаблицаИнструментов.Колонки.Добавить("Инструмент", 				Новый ОписаниеТипов("СправочникСсылка.AIG_Инструменты"));
	
	Возврат ТаблицаИнструментов;
	
КонецФункции

Функция СтруктураДоступногоОбъектаИнструментов() Экспорт
	
	Структура = Новый Структура;
	Структура.Вставить("Имя", 		"");
	Структура.Вставить("Синоним", 	"");
	Структура.Вставить("Описание", 	"");
	
	Возврат Структура;
	
КонецФункции

Процедура ЗаполнитьТаблицуИнструментов(ТаблицаИнструментов)
	
	СоставПодсистемыКонтейнеры = Метаданные.Подсистемы.AIG_AIGateway.Подсистемы.AIG_Инструменты.Состав;
	
	Для Каждого МД Из СоставПодсистемыКонтейнеры Цикл
		
		Если НЕ Метаданные.Обработки.Содержит(МД) Тогда
			Продолжить;
		КонецЕсли;
		
		МенеджерОбработки = Обработки[МД.Имя];
		
		ТекущаяТаблицаИнструментов = ТаблицаИнструментов.СкопироватьКолонки();
		
		МенеджерОбработки.ДобавитьИнструменты(ТекущаяТаблицаИнструментов);
		
		Для Каждого Строка Из ТекущаяТаблицаИнструментов Цикл

			СтрокаОбщейТаблицы = ТаблицаИнструментов.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаОбщейТаблицы, Строка);
			СтрокаОбщейТаблицы.ИмяОбработкиКонтейнера 	= МД.Имя;
			СтрокаОбщейТаблицы.Инструмент 				= Справочники.AIG_Инструменты.НайтиПоНаименованию(Строка.Имя);
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПараметрИнструмента(Имя, Тип = Неопределено, Описание = Неопределено, ЗначениеПоУмолчанию = Неопределено, Обязательный = Ложь, СписокДопустимыхЗначений = "") Экспорт
	
	ОписаниеПараметра = Новый Структура;
	ОписаниеПараметра.Вставить("ТипЭлемента", "ПростойПараметр");
	ОписаниеПараметра.Вставить("Имя", Имя);
	ОписаниеПараметра.Вставить("Описание", Описание);
	ОписаниеПараметра.Вставить("Тип", Тип);
	ОписаниеПараметра.Вставить("ЗначениеПоУмолчанию", ЗначениеПоУмолчанию);
	ОписаниеПараметра.Вставить("Обязательный", Обязательный);
	ОписаниеПараметра.Вставить("СписокДопустимыхЗначений", СписокДопустимыхЗначений);
	
	Возврат ОписаниеПараметра;
	
КонецФункции

Функция ПараметрИнструментаМассив(Имя, ТипЭлементаМассива = Неопределено, Описание = Неопределено, Обязательный = Ложь, СписокДопустимыхЗначенийЭлемента = "") Экспорт
	
	ОписаниеПараметра = Новый Структура;
	ОписаниеПараметра.Вставить("ТипЭлемента", "Массив");
	ОписаниеПараметра.Вставить("Имя", Имя);
	ОписаниеПараметра.Вставить("Описание", Описание);
	ОписаниеПараметра.Вставить("ТипЭлементаМассива", ТипЭлементаМассива);
	ОписаниеПараметра.Вставить("Обязательный", Обязательный);
	ОписаниеПараметра.Вставить("СписокДопустимыхЗначенийЭлемента", СписокДопустимыхЗначенийЭлемента);
	
	Возврат ОписаниеПараметра;
	
КонецФункции

Функция СхемаПараметровИнструмента(МассивОписанийПараметров) Экспорт
	
	Схема = Новый Структура;
	Схема.Вставить("type", "object");
	
	Свойства = Новый Структура;
	ОбязательныеПараметры = Новый Массив;
	
	Для Каждого ОписаниеПараметра Из МассивОписанийПараметров Цикл
		
		ИмяПараметра = ОписаниеПараметра.Имя;
		СвойствоПараметра = Новый Структура;
		
		Если ОписаниеПараметра.ТипЭлемента = "ПростойПараметр" Тогда
			
			Если ЗначениеЗаполнено(ОписаниеПараметра.Тип) Тогда
				СвойствоПараметра.Вставить("type", ОписаниеПараметра.Тип);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ОписаниеПараметра.Описание) Тогда
				СвойствоПараметра.Вставить("description", ОписаниеПараметра.Описание);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ОписаниеПараметра.ЗначениеПоУмолчанию) Тогда
				СвойствоПараметра.Вставить("default", ОписаниеПараметра.ЗначениеПоУмолчанию);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ОписаниеПараметра.СписокДопустимыхЗначений) Тогда
				МассивЗначений = МассивДопустимыхЗначений(ОписаниеПараметра.СписокДопустимыхЗначений);
				СвойствоПараметра.Вставить("enum", МассивЗначений);
			КонецЕсли;
			
		ИначеЕсли ОписаниеПараметра.ТипЭлемента = "Массив" Тогда
			
			СвойствоПараметра.Вставить("type", "array");
			
			Если ЗначениеЗаполнено(ОписаниеПараметра.Описание) Тогда
				СвойствоПараметра.Вставить("description", ОписаниеПараметра.Описание);
			КонецЕсли;
			
			ЭлементМассива = Новый Структура; 
			
			Если ЗначениеЗаполнено(ОписаниеПараметра.ТипЭлементаМассива) Тогда
				ЭлементМассива.Вставить("type", ОписаниеПараметра.ТипЭлементаМассива);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ОписаниеПараметра.СписокДопустимыхЗначенийЭлемента) Тогда
				МассивЗначений = МассивДопустимыхЗначений(ОписаниеПараметра.СписокДопустимыхЗначенийЭлемента);
				ЭлементМассива.Вставить("enum", МассивЗначений);
			КонецЕсли;
			
			properties_type = Новый Структура("type", "string");
			properties = Новый Структура("key", properties_type);
			
			properties_value = Новый Структура("type", "string");
			properties.Вставить("value", properties_value);
			
			ЭлементМассива.Вставить("properties", properties); 
			
			СвойствоПараметра.Вставить("items", ЭлементМассива);
			
		КонецЕсли;
		
		Свойства.Вставить(ИмяПараметра, СвойствоПараметра);
		
		Если ОписаниеПараметра.Обязательный Тогда
			ОбязательныеПараметры.Добавить(ИмяПараметра);
		КонецЕсли;
		
	КонецЦикла;
	
	Схема.Вставить("properties", Свойства);
	
	Если ОбязательныеПараметры.Количество() > 0 Тогда
		Схема.Вставить("required", ОбязательныеПараметры);
	КонецЕсли;
	
	Возврат AIG_ОбщегоНазначения.ДанныеВJSON(Схема);
	
КонецФункции

Функция МассивДопустимыхЗначений(СписокДопустимыхЗначений)
	
	МассивИсходныхЗначений = СтрРазделить(СписокДопустимыхЗначений, ",", Ложь);
	МассивЗначений = Новый Массив;
	Для Каждого Значение Из МассивИсходныхЗначений Цикл
		МассивЗначений.Добавить(СокрЛП(Значение));
	КонецЦикла;
	
	Возврат МассивЗначений;
	
КонецФункции

#КонецОбласти
